Процедура Обработать(ПараметрЗапуска) Экспорт
	
	Путь = СтрРазделить(ПараметрЗапуска, " ")[1];
	
	Если СтрНайти(ПараметрЗапуска, "upload") <> 0 Тогда
		
		ДД = Новый ДвоичныеДанные(Путь);
		Адрес = ПоместитьВоВременноеХранилище(ДД);
			
		ДевБаттл_ВыгрузкаЗагрузкаВопросов.ЗагрузитьВопросы(Адрес);
		
	ИначеЕсли СтрНайти(ПараметрЗапуска, "dump") <> 0 Тогда                                   
		
		Адрес = ДевБаттл_ВыгрузкаЗагрузкаВопросов.ПолучитьВыгрузкуВопросов(); 
		
		ПолучитьИзВременногоХранилища(Адрес).Записать(Путь);
			
	КонецЕсли;
	
КонецПроцедуры